DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Src/garvich/RUS_Regul_ADC.c
// VIKPB_ADC.c
// »нициализация и запуск ј÷ѕ
/*****************************************************************************************************************************************/

#include "stm32l4xx_hal.h"		// дрова периферии
#include "ProjectConfig.h"		// конфиг платформы, конфиг задачи.
#include "platform_common.h"
#include "RUS_Regul_ADC.h"			// родной
#include "Stm32l4xx_hal_adc.h"	// HAL ADC driver
#include <string.h>				// memcpy()
#include "MathUtils.h"				// DIVIDE()

#include "FreeRTOS.h"
#include "RUS_Regul_Events.h"				// объявление √руппы событий прибора √√ѕ
#include "RUS_Regul_ADC.h"

#pragma pack( 1 )
typedef struct ADC_Channel_struct
{
	uint32_t		Channel;
	GPIO_TypeDef	*pPort;
	uint16_t		Pin;
	uint32_t		SingleDiff;		// ¬ыбор дифференциальный канал (текущий позитив, +1 негатив) или single-ended
} ADC_Channel_t;
#pragma pack( )

//  аналы дл€ корпуса LQFP48
const ADC_Channel_t aADC_Channels[] = 
{	
	{ ADC_CHANNEL_5,	GPIOA,	GPIO_PIN_0, 	ADC_SINGLE_ENDED }, 			// PA0						0	
	{ ADC_CHANNEL_6,	GPIOA,	GPIO_PIN_1, 	ADC_SINGLE_ENDED }, 			// PA1						1
	{ ADC_CHANNEL_7,	GPIOA,	GPIO_PIN_2, 	ADC_SINGLE_ENDED }, 			// PA2						2
	{ ADC_CHANNEL_8,	GPIOA,	GPIO_PIN_3, 	ADC_SINGLE_ENDED }, 			// PA3						3	OPAMP
	{ ADC_CHANNEL_9,	GPIOA,	GPIO_PIN_4, 	ADC_SINGLE_ENDED }, 			// PA4						4
	{ ADC_CHANNEL_10,	GPIOA,	GPIO_PIN_5, 	ADC_SINGLE_ENDED }, 			// PA5						5
	{ ADC_CHANNEL_11,	GPIOA,	GPIO_PIN_6, 	ADC_SINGLE_ENDED }, 			// PA6						6	AIN_UHV			Ќапряжение обратной связи с высоковольтника гаммы	
	{ ADC_CHANNEL_12,	GPIOA,	GPIO_PIN_7, 	ADC_SINGLE_ENDED }, 			// PA7						7	
	{ ADC_CHANNEL_15,	GPIOB,	GPIO_PIN_0, 	ADC_DIFFERENTIAL_ENDED },		// PB0						8	
	{ ADC_CHANNEL_16,	GPIOB,	GPIO_PIN_1, 	ADC_DIFFERENTIAL_ENDED },		// PB1						9
	// внутренние каналы
	{ ADC_CHANNEL_TEMPSENSOR,	NULL,	0,		ADC_SINGLE_ENDED },	 			// Temp Sensor				10
	{ ADC_CHANNEL_VREFINT,		NULL,	0,		ADC_SINGLE_ENDED }, 			// ADC_CHANNEL_VREFINT		11
	{ ADC_CHANNEL_VBAT, 		NULL,	0,		ADC_SINGLE_ENDED },		 		// ADC_CHANNEL_VBAT 		12
	{ ADC_CHANNEL_DAC1CH2, 		NULL,	0,		ADC_SINGLE_ENDED },				// ADC_CHANNEL_18			13
};
	
	// ќпределение порядка сканирования регулярной группы
	#define ADC1_REGULAR_CHANNEL_GROUP		{2, 3, 10, 11}			// DC напряжения
	#define iAIN_ADC1_PW_MANAGE		0							// индекс канала в массиве результатов	ј÷ѕ дл€ оцифровки напр€жен€ через делитель на плате 33к / 10к
	#define iAIN_ADC1_OPAMP 		1							// индекс канала в массиве результатов	ј÷ѕ дл€ оцифровки потреблени€ через шунт 0.1 ќм
	#define iAIN_ADC1_TEMPSENSOR	2							// индекс канала в массиве результатов	ј÷ѕ дл€ оцифровки внутренней температуры контроллера
	#define iAIN_ADC1_VREFINT		3							// индекс канала в массиве результатов	ј÷ѕ дл€ оцифровки опроноо напр€жени€
	#define iAIN_ADC1_TOTAL			4							// всего каналов в массиве


// *******************************************************************



// Static функции модуля
static void RUS_Regul_ADC1_DeInit( void );
static void HAL_ADC1_MspInit( void );
static void HAL_ADC1_MspDeInit( ADC_HandleTypeDef* hadc );


// √руппа аналоговых каналов не определена для неподготовленной платформы.
// »спользовать затычку, имитирующую работу ј÷ѕ

#if (!defined(ADC1_REGULAR_CHANNEL_GROUP))
void RUS_Regul_ADC_Init( void )						{ }
void RUS_Regul_ADC_DeInit( void )						{ }
void RUS_Regul_ADC_Start( void )									{ }
void RUS_Regul_ADC_Stop( void )									{ }
float RUS_Regul_ADC_GetSampleRate( void )					{ return 0; }
void RUS_Regul_ADC_GetVoltages( RUS_Regul_ADC_AI_t *pAI )		{ *pAI = ( RUS_Regul_ADC_AI_t ) { 0 }; }
#else

// ѕорядок оцифровки каналов через регул€рную группу
static const uint8_t aADC1_RegularChannelGroup[] = ADC1_REGULAR_CHANNEL_GROUP;

#define	RUS_Regul_ADC1_CHANNEL_COUNT		SIZEOFARRAY( aADC1_RegularChannelGroup )
#define RUS_Regul_ADC1_DC_CHANNEL_COUNT		5

#define ADC1_IIR_DEPTH				16
#define	iADC_NOT_INIT				-1
#define ADC1_COPYBUFFER_HALFDEPTH	16
#define ADC1_ARRAY_CNT   			ADC1_COPYBUFFER_HALFDEPTH
#define ADC1_BETA					0.1f	//  оэффициент бета для фильтра усреднения оцифровок для получения постоянных значений каналов


// Ќаплатные делители напр€жений
#define RUS_Regul_AIN_DEVISOR		((float)(10.0f / (10.0f + 33.0f))) // ¬ кќм

// ÷иклический буфер, в который складывается оцифровка через DMA
// Ѕуфер двойного размера - при заполнении половины буфера и всего буфера возникают прерывания,
// по которым соответствующую половину буфера необходимо скопировать в "безопасное" место
static ADC1_Data_t	aADC1BufferTemp[ 2 ] [ ADC1_COPYBUFFER_HALFDEPTH ] [ RUS_Regul_ADC1_CHANNEL_COUNT ];	// Ѕуфер для хранения результатов оцифровок

//#define	DIVIDE( _VALUE_, _BASE_ )	( ( ( _VALUE_ ) + ( _BASE_ ) / 2 ) / ( _BASE_ ) )		// деление с округлением

// —водная структура данных ј÷ѕ –егул€тора
typedef struct RUS_Regul_ADC_struct
{
	// ADC & ADC.DMA handlers declaration
	
	ADC_HandleTypeDef ADC1_hdl;
	DMA_HandleTypeDef ADC1_DMA_hdl;
	
	// ”казатели на буферы, не размещенные в составе структуры
	uint8_t const	*pADC1RegularChannelGroup;
	ADC1_Data_t		*pADC1BufferDMA;

	// »ндексы выделенных каналов
	int8_t iChannelVref;
	int8_t iChannelTS;

	// Ѕуферы в составе структуры
	uint16_t	aBufferIIR[RUS_Regul_ADC1_CHANNEL_COUNT];	// Ѕуфер для фильтрации результатов оцифровки. ƒля экономии памяти - фильтр с бесконечной импульсной характеристикой
													// !! буфер обновляется в обработчике прерывания ADC1.DMA!
	float		aADC1AI_V[RUS_Regul_ADC1_CHANNEL_COUNT];			// [¬] ћассив для отнормированных измерений ј÷ѕ

	
	float  		aADC1_Value[RUS_Regul_ADC1_CHANNEL_COUNT];	// ћассив для усредненных значений ј÷ѕ 

	uint8_t		adcDCSignalStabilized;	// флаг установившихся показаний постоянных напряжений
	uint16_t	adcDCSignalStabilized_cnt;	// текущее значение счетчика циклов стабилизации (изначально 0, потом растет до CNTMAX, после чего поднимаетс флаг, что напряжение стабилизировалось)
	// Ѕуфер линейный относительно половины буфера DMA каждого канала постонного сигнала ј÷ѕ1
	ADC1_Data_t aADC1BufferDCSignalChannel[ 2 ] [ RUS_Regul_ADC1_CHANNEL_COUNT ] [ ADC1_COPYBUFFER_HALFDEPTH ];		// Ѕуфер для хранения результатов оцифровок постоянных сигналов (DC), используется при копировании из буфера DMA

	RUS_Regul_ADC_AI_t			AnalogInputs;			// ¬ыходные данные из драйвера ј÷ѕ (ADC)
	uint32_t	VPLCsumValue;		// [ед ј÷ѕ]. —умма значений ј÷ѕ за период.
	uint32_t	VPLCsumCnt;			// [ед] —четчик суммы дл€ усреднени€
	bool		VPLCsumEnable;		// –азрешение накопление измерений VPLC
	float		VPLCsumVoltage;		// [¬] ”средненное значение накопленных измерений VPLC
	uint32_t	VPLCminValue;		// [ед ј÷ѕ]. ћинимальное значение ј÷ѕ за период.
	float		VPLCminVoltage;		// [¬] ћинимальное значение измерений VPLC за период
} RUS_Regul_ADC_t;

