DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Src/garvich/RUS_Regul_ADC.c
static RUS_Regul_ADC_t RUS_Regul_ADC /*__PLACE_AT_RAM_CCM__*/ = { 0 };

static inline float ADC_GetFromIIR( uint16_t const *pBufferIIR, uint8_t i )
{
	assert_param( i < RUS_Regul_ADC1_CHANNEL_COUNT );
	return ( ( float ) pBufferIIR[i] ) / ADC1_IIR_DEPTH;
}

/*********************************************************
ѕрописать порядок оцифровки служебных сигналов через ADC1.
ѕрописать порядок оцифровки акселерометров через ADC2.
*********************************************************/

// Ќизкоуровневые инициализатор и деинициализатор ј÷ѕ.
// Ќеобходимо определить, для какого канала ј÷ѕ вызов, и вызвать соответствуеющий инициализатор
void HAL_ADC_MspInit( ADC_HandleTypeDef* hadc )
{
	if( hadc == &RUS_Regul_ADC.ADC1_hdl )
		HAL_ADC1_MspInit( );
	else
		assert_param( 0 );
}

static void HAL_ADC1_MspInit( void )
{
	// -1- Enable peripherals and GPIO Clocks #################################
	ADC_CLK_ENABLE( ADC1 );
	DMA_CLK_ENABLE( ADC1_DMA_INSTANCE );
	for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
	{
		ADC_Channel_t const *pChannel = &aADC_Channels[ RUS_Regul_ADC.pADC1RegularChannelGroup[i] ];
		if( NULL != pChannel->pPort )
			GPIO_CLK_ENABLE( pChannel->pPort );
	}
	
	// -2- Configure peripheral GPIO ##########################################
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Mode	= GPIO_MODE_ANALOG;
	GPIO_InitStruct.Pull	= GPIO_NOPULL;		// подтяжки в аналоговом режиме не работают?
	for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
	{
		ADC_Channel_t const *pChannel = &aADC_Channels[ RUS_Regul_ADC.pADC1RegularChannelGroup[i] ];
		if( NULL != pChannel->pPort )
		{
			GPIO_InitStruct.Pin = pChannel->Pin;
			HAL_GPIO_Init( pChannel->pPort, &GPIO_InitStruct );
		}
	}
	
	// -3- Configure the DMA streams ##########################################
	assert_param( sizeof( ADC1_Data_t ) == sizeof( uint16_t ) );		// DMA затачивается на работу с 16-битными словами
  	DMA_InitTypeDef DmaInit;
	DmaInit.Direction			= DMA_PERIPH_TO_MEMORY;
	DmaInit.PeriphInc			= DMA_PINC_DISABLE;
	DmaInit.MemInc				= DMA_MINC_ENABLE;
	DmaInit.PeriphDataAlignment	= DMA_PDATAALIGN_HALFWORD;
	DmaInit.MemDataAlignment	= DMA_MDATAALIGN_HALFWORD;
	DmaInit.Mode				= DMA_CIRCULAR;
	DmaInit.Priority			= ADC_DMA_PRIORITY;
	#if defined (STM32F4)
	DmaInit.FIFOMode			= DMA_FIFOMODE_DISABLE;         
	DmaInit.FIFOThreshold		= DMA_FIFO_THRESHOLD_HALFFULL;		// зачем?
	DmaInit.MemBurst			= DMA_MBURST_SINGLE;
	DmaInit.PeriphBurst			= DMA_PBURST_SINGLE; 
	DmaInit.Channel 			= ADC1_DMA_CHANNEL;
	#endif // STM32F4
	#if defined (STM32L4) 
	DmaInit.Request				= DMA_REQUEST_0;
	#endif // STM32L4
	RUS_Regul_ADC.ADC1_DMA_hdl.Instance	= ADC1_DMA_INSTANCE;
	RUS_Regul_ADC.ADC1_DMA_hdl.Init		= DmaInit;
	assert_param( HAL_OK == HAL_DMA_Init( &RUS_Regul_ADC.ADC1_DMA_hdl ) );
	__HAL_LINKDMA( &RUS_Regul_ADC.ADC1_hdl, DMA_Handle, RUS_Regul_ADC.ADC1_DMA_hdl );
	
	// -4- Configure the NVIC for DMA #########################################
	HAL_NVIC_SetPriority( ADC1_DMA_IRQn, ADC_DMA_IRQ_PREEMTPRIORITY, ADC_DMA_IRQ_SUBPRIORITY );
	HAL_NVIC_EnableIRQ( ADC1_DMA_IRQn );
}

void HAL_ADC_MspDeInit( ADC_HandleTypeDef* hadc )
{
	if( hadc == &RUS_Regul_ADC.ADC1_hdl )
		HAL_ADC1_MspDeInit( hadc );
	else
		assert_param( 0 );
}

static void HAL_ADC1_MspDeInit( ADC_HandleTypeDef* hadc )
{
	assert_param( hadc == &RUS_Regul_ADC.ADC1_hdl );
	if( HAL_DMA_GetState( &RUS_Regul_ADC.ADC1_DMA_hdl ) != HAL_DMA_STATE_READY )
		assert_param( HAL_OK == HAL_DMA_Abort( &RUS_Regul_ADC.ADC1_DMA_hdl ) );
	assert_param( HAL_OK == HAL_DMA_DeInit( &RUS_Regul_ADC.ADC1_DMA_hdl ) );
	HAL_NVIC_DisableIRQ( ADC1_DMA_IRQn );
}

// »нициализация программного модуля ADC 
void RUS_Regul_ADC_Init( void )
{
	RUS_Regul_ADC1_Init( );
	RUS_Regul_ADC.adcDCSignalStabilized = 0;
}

// ƒеинициализация программного модуля ADC
void RUS_Regul_ADC_DeInit( void )
{
	RUS_Regul_ADC1_DeInit( );
}


void RUS_Regul_ADC1_Init( void )
{
	// Ќачальная инициализация основной структуры данных
	RUS_Regul_ADC.pADC1RegularChannelGroup = aADC1_RegularChannelGroup;
	RUS_Regul_ADC.pADC1BufferDMA = &aADC1BufferTemp[0][0][0];


	for ( uint8_t i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
	{
		RUS_Regul_ADC.aADC1_Value[i] = 0.0f;
	}

	ADC_ChannelConfTypeDef CConfig;
	ADC_InitTypeDef	Init;
	ADC_HandleTypeDef *pAdcHandle;

#if defined (STM32F3)
#if defined(STM32F373xC) || defined(STM32F378xx)
	Init.DataAlign				= ADC_DATAALIGN_LEFT;
	Init.ScanConvMode			= ADC_SCAN_ENABLE;
#if defined( ADC_TRIGGER_TIMER )
		Init.ContinuousConvMode		= DISABLE;
#elif defined( ADC_TRIGGER_SOFTWARE )
		Init.ContinuousConvMode		= ENABLE;
#endif // #if defined( ADC_TRIGGER )
	Init.DiscontinuousConvMode	= DISABLE;
	Init.NbrOfDiscConversion	= 0;
#if defined( ADC_TRIGGER_TIMER )
		Init.ExternalTrigConv		= ADC_TRIGGER_TIM;
#elif defined( ADC_TRIGGER_SOFTWARE )
		Init.ExternalTrigConv		= ADC_SOFTWARE_START;
#endif // #if defined( ADC_TRIGGER )
#elif 
	Init.ClockPrescaler			= ADC1_CLOCKPRESCALER;
	Init.Resolution				= ADC1_RESOLUTION;
	Init.ScanConvMode			= ENABLE;
	Init.ContinuousConvMode		= ENABLE;
	Init.DiscontinuousConvMode	= DISABLE;
	Init.NbrOfDiscConversion	= 0;
	Init.ExternalTrigConvEdge	= ADC_EXTERNALTRIGCONVEDGE_NONE;
	Init.ExternalTrigConv		= ADC_EXTERNALTRIGCONV_T1_CC1;		// т.к. ADC_EXTERNALTRIGCONVEDGE_NONE, то ве равно
	Init.DataAlign				= ADC_DATAALIGN;
	Init.DMAContinuousRequests	= ENABLE;
	Init.EOCSelection			= ADC_EOC_SEQ_CONV;
#endif // Platform-depended Init struct
#endif // #if defined (STM32F3)
	
#if defined (STM32L4)
	Init.ClockPrescaler 		= ADC1_CLOCKPRESCALER;
	Init.Resolution 			= ADC1_RESOLUTION;
	Init.DataAlign				= ADC1_DATAALIGN;
	Init.ScanConvMode			= ADC_SCAN_ENABLE;
	Init.EOCSelection			= ADC_EOC_SEQ_CONV;
	Init.LowPowerAutoWait		= DISABLE;
	// ¬ыбор триггера для старта преобразований
#if defined( ADC1_TRIGGER_TIMER )
		Init.ContinuousConvMode		= DISABLE;
#elif defined( ADC1_TRIGGER_SOFTWARE )
		Init.ContinuousConvMode		= ENABLE;
#endif // #if defined( ADC_TRIGGER )
	Init.DiscontinuousConvMode	= DISABLE;
	Init.NbrOfDiscConversion	= 0;
#if defined( ADC1_TRIGGER_TIMER )
		Init.ExternalTrigConv		= ADC_TRIGGER_TIM;
#elif defined( ADC1_TRIGGER_SOFTWARE )
		Init.ExternalTrigConv		= ADC_SOFTWARE_START;
#endif // #if defined( ADC_TRIGGER )
	Init.ExternalTrigConvEdge	= ADC_EXTERNALTRIGCONVEDGE_NONE;
	Init.DMAContinuousRequests	= ENABLE;
	Init.Overrun				= ADC_OVR_DATA_OVERWRITTEN;
	Init.OversamplingMode		= DISABLE;
	Init.Oversampling.Ratio 	= ADC_OVERSAMPLING_RATIO_2;
	Init.Oversampling.RightBitShift = ADC_RIGHTBITSHIFT_NONE;
	Init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
	Init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE;
	#if defined(ADC_CFGR_DFSDMCFG) &&defined(DFSDM1_Channel0)
  	Init.DFSDMConfig			= ADC_DFSDM_MODE_DISABLE;           /*!< Specify whether ADC conversion data is sent directly to DFSDM.
                                       This parameter can be a value of @ref ADC_HAL_EC_REG_DFSDM_TRANSFER.
                                       Note: This parameter can be modified only if there is no conversion is ongoing (both ADSTART and JADSTART cleared). */
	#warning "Filed DFSDMConfig"
#endif

#endif // #if defined (STM32L4)

