DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Src/garvich/RUS_Regul_ADC.c
	// ADC1
	pAdcHandle				= &RUS_Regul_ADC.ADC1_hdl;
	pAdcHandle->Instance	= ADC1;
	Init.NbrOfConversion	= RUS_Regul_ADC1_CHANNEL_COUNT;
	pAdcHandle->Init		= Init;
	assert_param( HAL_OK == HAL_ADC_Init( pAdcHandle ) );

#if defined (STM32F3)
	// Config Channel Scan Sequence for ADC1
#if defined(STM32F373xC) || defined(STM32F378xx)
	CConfig.Rank			= 1;
	CConfig.SamplingTime	= ADC_SAMPLINGTIME;
#elif
	CConfig.Rank			= 1;
	CConfig.SamplingTime	= ADC_SAMPLINGTIME;
	CConfig.Offset			= 0;
#endif // Platform-depended CConfig struct 
#endif // #if defined (STM32F3)

#if defined (STM32L4)
	// Config Channel Scan Sequence for ADC1
	CConfig.Rank			= 1;
	CConfig.SamplingTime	= ADC1_SAMPLINGTIME;
	CConfig.OffsetNumber	= ADC_OFFSET_NONE;
	CConfig.Offset			= 0; 
#endif // #if defined (STM32L4)
	
	for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
	{
		switch( i )
		{
		case 0:	CConfig.Rank = ADC_REGULAR_RANK_1;	break;
		case 1:	CConfig.Rank = ADC_REGULAR_RANK_2;	break;
		case 2:	CConfig.Rank = ADC_REGULAR_RANK_3;	break;
		case 3:	CConfig.Rank = ADC_REGULAR_RANK_4;	break;
		case 4:	CConfig.Rank = ADC_REGULAR_RANK_5;	break;
		case 5:	CConfig.Rank = ADC_REGULAR_RANK_6;	break;
		case 6:	CConfig.Rank = ADC_REGULAR_RANK_7;	break;
		case 7:	CConfig.Rank = ADC_REGULAR_RANK_8;	break;
		default:	assert_param( 0 );
		}
		CConfig.Channel = aADC_Channels[ RUS_Regul_ADC.pADC1RegularChannelGroup[i] ].Channel;
		CConfig.SingleDiff = aADC_Channels[ RUS_Regul_ADC.pADC1RegularChannelGroup[i] ].SingleDiff;
		assert_param( HAL_OK == HAL_ADC_ConfigChannel( pAdcHandle, &CConfig ) );

		// ƒополнительная обработка для выделенных каналов
		// !! Ќеобходимо проверять на минимально допустимое время семплирования при работе со встроенными каналами - (VrefInt/Vbat/TempSensor)
		switch( CConfig.Channel )
		{
		case ADC_CHANNEL_VREFINT:
			//assert_param( iADC_NOT_INIT == BKS_ADC.iChannelVref );
			RUS_Regul_ADC.iChannelVref = i;
			break;
		case ADC_CHANNEL_TEMPSENSOR:
			//assert_param( iADC_NOT_INIT == BKS_ADC.iChannelTS );
			RUS_Regul_ADC.iChannelTS = i;
			break;
		case ADC_CHANNEL_VBAT:
			break;
		/*case ADC_CHANNEL_DAC1CH2:
			{
				uint32_t tmp_config_internal_channel = LL_ADC_GetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(pAdcHandle->Instance));
				LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(pAdcHandle->Instance), ADC_CHANNEL_DAC1CH2 | tmp_config_internal_channel);
			}
			break;*/
		default:
			break;
		}

		// 18.09.2020 ѕопытка добавить калибровку для получения более точных значений оцифровки
		assert_param( HAL_OK == HAL_ADCEx_Calibration_Start(pAdcHandle, ADC_SINGLE_ENDED) );
	}
}

static void RUS_Regul_ADC1_DeInit( void )
{
	assert_param( HAL_OK == HAL_ADC_DeInit( &RUS_Regul_ADC.ADC1_hdl ) );
}
/*
void MPI_ADC_DeInit( void )
{
	assert_param( HAL_OK == HAL_ADC_DeInit( &RUS_Regul_ADC.ADC_hdl ) );
}
*/
// ќбработчики прерываний от ADC DMA
// Ѕуфер оцифровки каждого канала заполняется от начала до конца и далее снова по циклу.
// ѕрерывания возникают при заполнении половины буфера и всего буфера.
// ѕервая и вторая половины буфера условно считаются первым и банком. ѕока один банк заполняется через DMA, второй обрабатывается процессором.
// ѕри этом важно, чтобы DMA и CPU не получали одновременного доступа к одному банку.
//  онтроль доступа к буферам:
// - в начале и в конце обработки буфера, процессор проверяет, что DMA в текущий момент контролирует другой буфер.
// - в начале обработки буфера процессор выставляет флаг доступа к этому буферу, в конце обработки - сбрасывает. ≈сли в начале обработки флаг выставлен, значит предыдущая обработка еще не завершилась, и состоялся конфликт.
//static bool bADC1_HalfConvCplt	= false;
//static bool bADC1_ConvCplt		= false;

//  опирование буфера DMA в буфер IRR с фильтрацией
// !! вызывается из обработчиков прерываний ADC.DMA.Cmplt и ADC.DMA.HalfCmplt
void ADC_IIR( bool bFirstBank )
{
	assert_param( ( ADC_LIMIT_MAX(ADC1_RESOLUTION_bits) * ADC1_IIR_DEPTH ) < 0xFFFF );
	ADC1_Data_t *pBuffDMA = ( bFirstBank ) ? ( RUS_Regul_ADC.pADC1BufferDMA ) : ( RUS_Regul_ADC.pADC1BufferDMA + RUS_Regul_ADC1_CHANNEL_COUNT );
	static bool bADC_IIR_InitComplete = false;
	if( bADC_IIR_InitComplete )
	{
		for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
			RUS_Regul_ADC.aBufferIIR[i] = RUS_Regul_ADC.aBufferIIR[i] - DIVIDE( RUS_Regul_ADC.aBufferIIR[i], ADC1_IIR_DEPTH ) + pBuffDMA[i];
	}
	else
	{	// ѕервичная инициализация фильтра первым оцифрованным значением
		for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
			RUS_Regul_ADC.aBufferIIR[i] = pBuffDMA[i] * ADC1_IIR_DEPTH;
		bADC_IIR_InitComplete = true;
	}
}

// ќбработчик прерываний от ADC1.DMA (оцифровка служебных сигналов)
// ¬ызвать библиотечный обработчик, дальнейшая обработка в коллбеках HAL_ADC_ConvHalfCpltCallback() и HAL_ADC_ConvCpltCallback()
void ADC1_DMA_IRQHandler( void )
{
	HAL_NVIC_ClearPendingIRQ( ADC1_DMA_IRQn );
	HAL_DMA_IRQHandler( &RUS_Regul_ADC.ADC1_DMA_hdl );
}

//  оллбеки из библиотечного обработчика прерываний от ADC#.DMA - HAL_DMA_IRQHandler()
void HAL_ADC_ConvHalfCpltCallback( ADC_HandleTypeDef* hadc )
{
	if( hadc == &RUS_Regul_ADC.ADC1_hdl )
	{	// ѕрерывание от ADC1.DMA (оцифровка служебных сигналов)
		// «авершено заполнение первого банка через DMA и уже начал заполняться второй банк.
		// ѕередать первый банк на обработку процессором.
		//ADC_IIR( true );
		// !! где-то здесь генерить событие для основной задачи?
		
		//  опирование из буфера DMA в буфер обработки оцифровок переменных сигналов
		//  опируются сразу все каналы измерения переменных сигналов
		ADC1_ConvRes_DCSignal_Copy( true, &RUS_Regul_ADC.aADC1BufferDCSignalChannel[0][0][0] );

		assert_param( NULL != RUS_Regul_EventGroup);
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		xEventGroupSetBitsFromISR( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_ADC1_FIRSTHALFBUFFER_READY, &xHigherPriorityTaskWoken );
	}
	else
		assert_param( 0 );
}

void HAL_ADC_ConvCpltCallback( ADC_HandleTypeDef* hadc )
{
	if( hadc == &RUS_Regul_ADC.ADC1_hdl )
	{	// ѕрерывание от ADC1.DMA (оцифровка служебных сигналов)
		// «авершено заполнение второго банка через DMA и уже начал заполняться первый банк.
		// ѕередать второй банк на обработку процессром.
		//ADC_IIR( false );

		//  опирование из буфера DMA в буфер обработки оцифровок переменных сигналов
		//  опируются сразу все каналы измерения переменных сигналов
		ADC1_ConvRes_DCSignal_Copy( false, &RUS_Regul_ADC.aADC1BufferDCSignalChannel[0][0][0] );

		assert_param( NULL != RUS_Regul_EventGroup );
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		xEventGroupSetBitsFromISR( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_ADC1_SECONDHALFBUFFER_READY, &xHigherPriorityTaskWoken );
	}
	else
		assert_param( 0 );
}

void HAL_ADC_ErrorCallback( ADC_HandleTypeDef *hadc )
{
	assert_param( hadc == &RUS_Regul_ADC.ADC1_hdl );
	assert_param( 0 );
	// !! где-то здесь генерить событие для основной задачи?
}

//  опирование буфера DMA в буфер накопления результатов оцифровок постоянных сигналов
// !! вызывается из обработчиков прерываний ADC.DMA.Cmplt и ADC.DMA.HalfCmplt
// ADC_Data_t *pBuffResult - указатель на буффер, куда сложить результаты оцифровок нужного канала (половина буфера DMA)
// uint8_t ChannelNmbr - индекс (номер) канала, результаты оцифровок которого будут скопированы из буфера DMA в буфер результата
void ADC1_ConvRes_DCSignal_Copy( bool bFirstBank, ADC1_Data_t *pBuffResult )
{
	uint8_t CurHalf;
	if ( bFirstBank )
		CurHalf = 0;
	else CurHalf = 1;
		
	for( uint16_t i = 0; i < ADC1_COPYBUFFER_HALFDEPTH; i++ )
	{
		for ( uint8_t j = 0; j < RUS_Regul_ADC1_CHANNEL_COUNT; j++ )
		{
			pBuffResult[CurHalf * RUS_Regul_ADC1_CHANNEL_COUNT * ADC1_COPYBUFFER_HALFDEPTH + i + j * ADC1_COPYBUFFER_HALFDEPTH ] = aADC1BufferTemp[CurHalf][i][j];
		}
	}
}

// ”среднение показаний по всем каналам ј÷ѕ за половину транзакций DMA
// ¬ызывается в основной программе по событию любой половинной передачи DMA (HT и TC)
// –езультат усреднения добавляется через комплементарный фильтр в усредненные значения по каналам в структуре BKS_ADC (в единицах ј÷ѕ)
void ADC1_AllChAvgHalfBuffer( bool bFirstBank )
{
	uint8_t CurHalf;
	if ( bFirstBank )
		CurHalf = 0;
	else CurHalf = 1;
	static bool ADC1_firsttime = true;
	const uint16_t CNTMAX = (uint16_t)( 1.0f / ADC1_BETA );
 	//static uint16_t cnt = 0;

	// ћассив сумм для каждого канала оцифровки
	uint32_t sum_ch[RUS_Regul_ADC1_CHANNEL_COUNT] = {0};
	uint32_t vlpc_avg_local = 0;
		
	for ( uint8_t j = 0; j < RUS_Regul_ADC1_CHANNEL_COUNT; j++ )
	{
		for( uint16_t i = 0; i < ADC1_COPYBUFFER_HALFDEPTH; i++ )
		{
			sum_ch[j] += aADC1BufferTemp[CurHalf][i][j];
		}
		if ( iAIN_ADC1_PW_MANAGE == j )
		{
			if ( RUS_Regul_ADC.VPLCsumEnable )
			{
				// ”средненное значение ј÷ѕ по каналу VPLC
				vlpc_avg_local = sum_ch[j] / ADC1_COPYBUFFER_HALFDEPTH;
				RUS_Regul_ADC.VPLCsumValue += vlpc_avg_local;
				RUS_Regul_ADC.VPLCsumCnt++;
				if ( vlpc_avg_local < RUS_Regul_ADC.VPLCminValue )
					RUS_Regul_ADC.VPLCminValue = vlpc_avg_local;
			}
		}
		if ( ADC1_firsttime )
		{
			RUS_Regul_ADC.aADC1_Value[j] = ( (float)sum_ch[j] ) / ADC1_COPYBUFFER_HALFDEPTH;
			ADC1_firsttime = false;
		}
		else
		{
			RUS_Regul_ADC.aADC1_Value[j] = ( RUS_Regul_ADC.aADC1_Value[j] * ( 1.0f - ADC1_BETA ) + ( ADC1_BETA * (float)sum_ch[j] / ADC1_COPYBUFFER_HALFDEPTH ) );
		}
	}

	// счетчик установшегося режима. «ависит от бета.  огда показания установились, выставить флаг
	if ( RUS_Regul_ADC.adcDCSignalStabilized_cnt < CNTMAX )
	{
		RUS_Regul_ADC.adcDCSignalStabilized_cnt++;
		if ( RUS_Regul_ADC.adcDCSignalStabilized_cnt == CNTMAX )
		{
			RUS_Regul_ADC.adcDCSignalStabilized = 1;
		}
	}
}

// «апустить оцифровку в циклический буфер
void RUS_Regul_ADC_Start( void )
{
	// ѕроверка адреса буфера на допустимость - должен быть выровнен по размеру слова обмена DMA (2 байта)
	assert_param( VALIDATE_ALIGN( RUS_Regul_ADC.pADC1BufferDMA, sizeof( *RUS_Regul_ADC.pADC1BufferDMA ) ) );
	// ѕроверка адреса буфера на допустимость - должен быть в пространстве ќ«”, доступном для записи по DMA
	assert_param( IS_DMA_WRITABLE_MEMORY( RUS_Regul_ADC.pADC1BufferDMA ) && IS_DMA_WRITABLE_MEMORY( RUS_Regul_ADC.pADC1BufferDMA + SIZEOFARRAY( RUS_Regul_ADC.pADC1BufferDMA ) ) );

	// ѕроверить готовность ј÷ѕ
	uint32_t AdcState = HAL_ADC_GetState( &RUS_Regul_ADC.ADC1_hdl );
	assert_param( ( HAL_ADC_STATE_READY == AdcState ) || ( HAL_ADC_STATE_REG_EOC == AdcState ) );

	// «апустить циклическую оцифровку
	HAL_ADC_Start_DMA( &RUS_Regul_ADC.ADC1_hdl, ( uint32_t * ) RUS_Regul_ADC.pADC1BufferDMA, RUS_Regul_ADC1_CHANNEL_COUNT * ADC1_COPYBUFFER_HALFDEPTH * 2 );
}

