DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Src/garvich/RUS_Regul_ADC.c
// ѕрекратить оцифровку
void RUS_Regul_ADC_Stop( void )
{
	assert_param( HAL_OK == HAL_ADC_Stop_DMA( &RUS_Regul_ADC.ADC1_hdl ) );
}


#if defined (USE_PLATFORM_OKR_354_10)
#define RUS_Regul_DEVISOR_VSUP	( (float) (33.0f + 10.0f) / 10.0f )		// ¬/¬
#define RUS_Regul_DEVISOR_OPAMP	( 1.0f / 16.0f / 0.1f )					// [ј/¬]	шунт 0.1 ќм, PGA x16

#else
#error Select Platform!
#endif


// –ассчитать измеренные напряжения
void RUS_Regul_ADC_GetVoltages( RUS_Regul_ADC_AI_t *pAI )
{	
	assert_param ( NULL != pAI );

	// —труктура для промежуточных результатов
	RUS_Regul_ADC_AI_t AI;
	float * const pVSUP = &AI.VSUP;
	float * const pChipTemp = &AI.Temp;

	// ѕересчитать коды ј÷ѕ в натуральные единицы
	// [V]		VDDA
	if( iADC_NOT_INIT == RUS_Regul_ADC.iChannelVref )
		*pVSUP = ADC_REFIN_CAL_VDDA;											// ќпора не оцифрована, взять по умолчанию
	else
	{
		float VDDA_ADC = RUS_Regul_ADC.aADC1_Value[RUS_Regul_ADC.iChannelVref];				// принять код ј÷ѕ из структуры данных (усредненные значения измерения постоянных сигналов) 
		*pVSUP = ADC_CALC_VDDA( VDDA_ADC );										// –ассчитать VDDA по опоре
		// ≈сли рассчитанное значение VDDA отличается от ожидаемой опоры (на 10%), то считать, что VDDA равно ожидаемой опоре
		// сделано, чтобы в начальные моменты не портить остальные показания, которые корректируются на текущее VDDA
		if ( ( *pVSUP > 1.1f * VDDA_VALUE_V ) || ( *pVSUP < 0.9f * VDDA_VALUE_V ) )
		{
			*pVSUP = VDDA_VALUE_V;
		}
	}
	// [degC]	“емпература чипа
	if( iADC_NOT_INIT == RUS_Regul_ADC.iChannelTS )
		*pChipTemp = -100;														// “ермодатчик не оцифрован, взять по умолчанию
	else
	{
		float TS_ADC = RUS_Regul_ADC.aADC1_Value[RUS_Regul_ADC.iChannelTS];					// принять код ј÷ѕ из структуры данных (усредненные значения измерения постоянных сигналов)
		TS_ADC *= *pVSUP / ADC_REFIN_CAL_VDDA;									// коррекция термодатчика при отклонении VDDA от 3,3 ¬ 
		*pChipTemp = ADC_CALC_TS_TEMP( TS_ADC );								// –ассчитать температуру по термодатчику
	}
	// [mV]		ќбычные каналы измерения напряжения
	for( int i = 0; i < RUS_Regul_ADC1_CHANNEL_COUNT; i++ )
	{
		float AIN_ADC = RUS_Regul_ADC.aADC1_Value[i];									// принять код ј÷ѕ из структуры данных (усредненные значения измерения постоянных сигналов)
		RUS_Regul_ADC.aADC1AI_V[i] = ADC_CALC_AIN( AIN_ADC, *pVSUP, ADC1_SPAN );		// [V]	AINx
	}

	// –ассчитать исходные сигналы по измеренным напряжениям
	AI.VDDA = *pVSUP;
	AI.VSUP	= RUS_Regul_ADC.aADC1AI_V[iAIN_ADC1_PW_MANAGE] * RUS_Regul_DEVISOR_VSUP;// / RUS_Regul_AIN_DEVISOR_UHV;
	AI.OPAMP_meas	= RUS_Regul_ADC.aADC1AI_V[iAIN_ADC1_OPAMP] * RUS_Regul_DEVISOR_OPAMP;// / RUS_Regul_AIN_DEVISOR_UHV;
	AI.VREF		= ( iADC_NOT_INIT == RUS_Regul_ADC.iChannelVref ) ? 0 : RUS_Regul_ADC.aADC1AI_V[ RUS_Regul_ADC.iChannelVref ];

	// —копировать во внутреннюю структуру программного модуля (необязательно, но сейчас DAC завязан VDDA из нее)
	RUS_Regul_ADC.AnalogInputs = AI;
	// —копировать промежуточные результаты
	ATOMIC_WRITE( *pAI, AI );
}

float ADC_OPAMP_Value_Get(void)
{
	return RUS_Regul_ADC.AnalogInputs.OPAMP_meas;
}

// ѕолучить величину постоянного сигнала VPLC в [¬]
float ADC_VSUP_Value_Get(void)
{
	return RUS_Regul_ADC.AnalogInputs.VSUP;
}

// ќтдать изеренное значение VDDA в [¬]
float ADC_getDCSignal_VDDA (void)
{
	return RUS_Regul_ADC.AnalogInputs.VDDA;
}

// ѕолучить текущее состояние флага установившихся показаний постоянных сигналов
uint8_t ADC_getFlagDCSignalStabilized( void )
{
	return RUS_Regul_ADC.adcDCSignalStabilized;
}

// ќпустить флаг стабилизации, сбросить счетчик
void ADC_clearFlagDCSignalStabilized( void )
{
	RUS_Regul_ADC.adcDCSignalStabilized = 0;
	RUS_Regul_ADC.adcDCSignalStabilized_cnt = 0;
}

// VPLC. ќбнулить накопившуюс€ сумму значений ј÷ѕ, сбросить счетчик сумм, разрешить накопление
void ADC_clearVPLCsum( void )
{
	RUS_Regul_ADC.VPLCsumValue = 0;
	RUS_Regul_ADC.VPLCsumCnt = 0;
	RUS_Regul_ADC.VPLCsumEnable = true;
	RUS_Regul_ADC.VPLCminValue = UINT16MAX;
}
// VPLC. –ассчитать усредненное значение VPLC в вольтах за врем€ накоплени€
// ƒопущение, что VDDA сильно не мен€етс€ за врем€ накоплени€
void ADC_calcVPLCsum( void )
{
	RUS_Regul_ADC.VPLCsumEnable = false;	// «апретить дальнейшее накопление
	float VPLCavg = RUS_Regul_ADC.VPLCsumValue / RUS_Regul_ADC.VPLCsumCnt;
	float vdda = ADC_CALC_VDDA( RUS_Regul_ADC.aADC1_Value[RUS_Regul_ADC.iChannelVref] );
	RUS_Regul_ADC.VPLCsumVoltage = ADC_CALC_AIN( VPLCavg, vdda, ADC1_SPAN ) * RUS_Regul_DEVISOR_VSUP;
	RUS_Regul_ADC.VPLCminVoltage = ADC_CALC_AIN( RUS_Regul_ADC.VPLCminValue, vdda, ADC1_SPAN ) * RUS_Regul_DEVISOR_VSUP;
}
// VPLC. ѕолучить усредненное значение VPLC в вольтах
float ADC_getVPLCsum( void )
{
	return RUS_Regul_ADC.VPLCsumVoltage;
}
// VPLC. ѕолучить минимальное значение VPLC в вольтах
float ADC_getVPLCmin( void )
{
	return RUS_Regul_ADC.VPLCminVoltage;
}

uint32_t ADC_getVPLCsumCnt( void )
{
	return RUS_Regul_ADC.VPLCsumCnt;
}
uint32_t ADC_getVPLCsumValue( void )
{
	return RUS_Regul_ADC.VPLCsumValue;
}
#endif // ADC1_REGULAR_CHANNEL_GROUP
